**** [[https://docs.racket-lang.org/ts-guide/occurrence-typing.html#%28part._.A_caveat_about_set_%29][5.4 A caveat about set!]]

"If a variable is ever mutated with set! in the scope in which it is defined,
Typed Racket cannot use occurrence typing with that variable."

"See [[https://docs.racket-lang.org/guide/set_.html#%28part._using-set%21%29][4.9.1 Guidelines for Using Assignment]] in the Racket Guide"
- "Racket style generally discourages the use of set!."
- "All else being equal, a program that uses no assignments or mutation is
  always preferable to one that uses assignments or mutation. While side effects
  are to be avoided, however, they should be used if the resulting code is
  significantly more readable or if it implements a significantly better
  algorithm."
- "The use of mutable values, such as vectors and hash tables, raises fewer
  suspicions about the style of a program than using set! directly.
  Nevertheless, simply replacing set!s in a program with vector-set!s obviously
  does not improve the style of the program."

"The types of top-level variables in the REPL cannot be refined by Typed Racket."

Why would these caveats exist if I've declared a type for the variable??

#+begin_src racket
#lang typed/racket
(: foo String)
(define foo "Hello!")
(set! foo "Goodbye!")
(displayln foo)
#+end_src

#+RESULTS:
: Goodbye!

I notice, btw, that I can't use set! on a top-level binding from the REPL in
Typed Racket if I haven't already done a set! in the definition window!

#+begin_src racket repl
  > (set! foo "Hello again!")
X foo: cannot modify a constant
#+end_src

**** [[https://docs.racket-lang.org/ts-guide/occurrence-typing.html#%28part._.Access_to_structure_fields%29][5.5 Access to structure fields]]

Occurrence typing can work with accessors to immutable structure fields.
- Yeah, so??

#+begin_src racket
#lang typed/racket
(struct apple ([a : Any]))
(struct (A) fruit ([a : A]))

(define (f [obj : Any]) : Number
  (cond
    [(and (apple? obj) (number? (apple-a obj))) (apple-a obj)]
    [(and (fruit? obj) (number? (fruit-a obj))) (fruit-a obj)]
    [else 42]))
;; Hmm, how do I use these?
(define apple-count (apple 1.5))
(define grape-count (fruit 20))
(define avocado-count (fruit 1/2))
(displayln (f apple-count))
(displayln (f grape-count))
(displayln (f avocado-count))
(displayln (f 'hello))
(: fruit-count (fruit Integer))
(: fruit-amount (fruit Real))
#;(define fruit-count avocado-count) ;; rejected by type checker
(define fruit-count grape-count)
(define fruit-amount avocado-count)
#+end_src

#+RESULTS:
: 1.5
: 20
: 1/2
: 42

#+begin_src racket repl
> apple-count
- : apple
#<apple>
> (apple-a apple-count)
- : Any
10
> grape-count
- : (fruit Positive-Byte)
#<fruit>
> avocado-count
- : (fruit Positive-Exact-Rational)
#<fruit>
#+end_src

